bench/results/nginx/fsBrev_f48k_c8.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f48k.bin
Document Length:        49152 bytes

Concurrency Level:      8
Time taken for tests:   5.199 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      247015000 bytes
HTML transferred:       245760000 bytes
Requests per second:    961.69 [#/sec] (mean)
Time per request:       8.319 [ms] (mean)
Time per request:       1.040 [ms] (mean, across all concurrent requests)
Transfer rate:          46396.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3  54.9      0    1272
Processing:     0    5  53.1      0     643
Waiting:        0    1  18.9      0     496
Total:          0    8  76.6      0    1284

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      1
  95%      1
  98%      4
  99%    364
 100%   1284 (longest request)