bench/results/nginx/fsBrev_f48k_c8_p1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f48k.bin
Document Length:        49152 bytes

Concurrency Level:      8
Time taken for tests:   5.384 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      247015000 bytes
HTML transferred:       245760000 bytes
Requests per second:    928.71 [#/sec] (mean)
Time per request:       8.614 [ms] (mean)
Time per request:       1.077 [ms] (mean, across all concurrent requests)
Transfer rate:          44805.64 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2  50.6      0    1273
Processing:     0    6  57.8      0     639
Waiting:        0    1  19.6      0     495
Total:          0    8  76.9      0    1284

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      1
  95%      2
  98%      5
  99%    495
 100%   1284 (longest request)