bench/results/nginx/fsBrev_f64k_c1_p1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f64k.bin
Document Length:        65536 bytes

Concurrency Level:      1
Time taken for tests:   9.412 seconds
Complete requests:      2000
Failed requests:        0
Total transferred:      131576000 bytes
HTML transferred:       131072000 bytes
Requests per second:    212.50 [#/sec] (mean)
Time per request:       4.706 [ms] (mean)
Time per request:       4.706 [ms] (mean, across all concurrent requests)
Transfer rate:          13652.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       3
Processing:     0    5  32.8      0     499
Waiting:        0    0   4.8      0     126
Total:          0    5  32.8      0     500

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      3
  99%    236
 100%    500 (longest request)