bench/results/nginx/fsBrev_f64k_c8_ka_p1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.0.1.2 (be patient).....done


Server Software:        nginx/1.28.0
Server Hostname:        10.0.1.2
Server Port:            80

Document Path:          /f64k.bin
Document Length:        65536 bytes

Concurrency Level:      8
Time taken for tests:   2.548 seconds
Complete requests:      2000
Failed requests:        0
Keep-Alive requests:    2000
Total transferred:      131586000 bytes
HTML transferred:       131072000 bytes
Requests per second:    785.08 [#/sec] (mean)
Time per request:       10.190 [ms] (mean)
Time per request:       1.274 [ms] (mean, across all concurrent requests)
Transfer rate:          50442.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1   10  65.8      1     559
Waiting:        0    8  58.8      1     557
Total:          1   10  65.8      1     559

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      3
  95%      7
  98%     11
  99%    550
 100%    559 (longest request)